import { sample } from "es-toolkit";

const 형용사 = [
  "귀여운",
  "힘쎈",
  "날렵한",
  "용감한",
  "똑똑한",
  "친절한",
  "신나는",
  "조용한",
  "화려한",
  "수줍은",
  "행복한",
  "슬픈",
  "기쁜",
  "차가운",
  "따뜻한",
  "멋진",
  "이상한",
  "재미있는",
  "지루한",
  "심각한",
];

const 동물 = [
  "코뿔소",
  "기린",
  "고양이",
  "강아지",
  "호랑이",
  "사자",
  "코끼리",
  "원숭이",
  "토끼",
  "다람쥐",
  "여우",
  "늑대",
  "곰",
  "펭귄",
  "고래",
  "상어",
  "돌고래",
  "참새",
  "비둘기",
  "까마귀",
];

export function getRandomUsername() {
  console.log("getRandomUsername");
  return `${sample(형용사)} ${sample(동물)}`;
}
